;(function($) {
	var self = this;

	const data_array = [
		["港湾・港湾海岸・空港", "浚渫工", "ポンプ浚渫工", "ポンプ浚渫"],
		["港湾・港湾海岸・空港", "浚渫工", "ポンプ浚渫工", "排砂管設備"],
		["港湾・港湾海岸・空港", "浚渫工", "高濃度浚渫工", ""],
		["港湾・港湾海岸・空港", "浚渫工", "グラブ浚渫工", "グラブ浚渫"],
		["港湾・港湾海岸・空港", "浚渫工", "グラブ浚渫工", "土運船運搬"],
		["港湾・港湾海岸・空港", "浚渫工", "硬土盤・岩盤浚渫工", "硬土盤・岩盤浚渫"],
		["港湾・港湾海岸・空港", "浚渫工", "硬土盤・岩盤浚渫工", "土運船運搬"],
		["港湾・港湾海岸・空港", "浚渫工", "バックホウ浚渫工", "バックホウ浚渫"],
		["港湾・港湾海岸・空港", "浚渫工", "バックホウ浚渫工", "土運船運搬"],
		["港湾・港湾海岸・空港", "浚渫工", "浚渫土工", "土砂掘削"],
		["港湾・港湾海岸・空港", "浚渫工", "浚渫土工", "土砂盛土"],
		["港湾・港湾海岸・空港", "浚渫工", "水中発破浚渫工", ""],
		["港湾・港湾海岸・空港", "浚渫工", "施工管理", ""],
		["港湾・港湾海岸・空港", "浚渫工", "その他", ""],
		["港湾・港湾海岸・空港", "土捨工", "排砂管設備工", "排砂管設備"],
		["港湾・港湾海岸・空港", "土捨工", "土運船運搬工", "土運船運搬"],
		["港湾・港湾海岸・空港", "土捨工", "揚土土捨工", "揚土土捨"],
		["港湾・港湾海岸・空港", "土捨工", "施工管理", ""],
		["港湾・港湾海岸・空港", "土捨工", "その他", ""],
		["港湾・港湾海岸・空港", "埋立工", "築堤工", ""],
		["港湾・港湾海岸・空港", "埋立工", "余水吐工", ""],
		["港湾・港湾海岸・空港", "埋立工", "事前混合処理工", ""],
		["港湾・港湾海岸・空港", "埋立工", "埋立工", "ポンプ土取"],
		["港湾・港湾海岸・空港", "埋立工", "埋立工", "クラブ土取"],
		["港湾・港湾海岸・空港", "埋立工", "埋立工", "ガット土取"],
		["港湾・港湾海岸・空港", "埋立工", "埋立工", "排砂管設備"],
		["港湾・港湾海岸・空港", "埋立工", "埋立工", "土運船運搬"],
		["港湾・港湾海岸・空港", "埋立工", "埋立工", "揚土埋立"],
		["港湾・港湾海岸・空港", "埋立工", "埋立土工", "土砂掘削"],
		["港湾・港湾海岸・空港", "埋立工", "埋立土工", "土砂盛土"],
		["港湾・港湾海岸・空港", "埋立工", "施工管理", "品質管理"],
		["港湾・港湾海岸・空港", "埋立工", "施工管理", "出来形管理"],
		["港湾・港湾海岸・空港", "埋立工", "施工管理", "その他"],
		["港湾・港湾海岸・空港", "埋立工", "その他", ""],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "ポンプ床掘"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "グラブ床掘"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "硬土盤床掘"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "砕岩床堀"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "排砂管設備"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "土運船運搬"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘工", "揚土土捨"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘土工", "土砂掘削"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "床掘土工", "土砂盛土"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "置換工", "置換材"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "置換工", "置換材均し"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "圧密・排水工", "サンドドレーン"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "圧密・排水工", "敷砂"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "圧密・排水工", "敷砂均し"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "圧密・排水工", "裁荷土砂"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "圧密・排水工", "ペーパードレーン"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "締固工", "サンドコンパクションパイル"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "締固工", "盛上土砂撤去"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "締固工", "敷砂"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "締固工", "敷砂均し"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "固化工", "深層混合処理杭"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "固化工", "敷砂"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "固化工", "敷砂均し"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "施工管理", "品質管理"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "施工管理", "出来形管理"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "施工管理", "その他"],
		["港湾・港湾海岸・空港", "海上地盤改良工", "その他", "その他"],
		["港湾・港湾海岸・空港", "基礎工", "基礎盛砂工", "盛砂"],
		["港湾・港湾海岸・空港", "基礎工", "基礎盛砂工", "盛砂均し"],
		["港湾・港湾海岸・空港", "基礎工", "洗掘防止工", "先掘防止"],
		["港湾・港湾海岸・空港", "基礎工", "基礎捨石工", "基礎捨石"],
		["港湾・港湾海岸・空港", "基礎工", "基礎捨石工", "捨石本均し"],
		["港湾・港湾海岸・空港", "基礎工", "基礎捨石工", "捨石荒均し"],
		["港湾・港湾海岸・空港", "基礎工", "袋詰コンクリート工", "袋詰コンクリート"],
		["港湾・港湾海岸・空港", "基礎工", "基礎ブロック工", "基礎ブロック製作"],
		["港湾・港湾海岸・空港", "基礎工", "基礎ブロック工", "基礎ブロック据付"],
		["港湾・港湾海岸・空港", "基礎工", "水中コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "基礎工", "水中コンクリート工", "漏洩防止"],
		["港湾・港湾海岸・空港", "基礎工", "水中コンクリート工", "水中コンクリート"],
		["港湾・港湾海岸・空港", "基礎工", "水中不分離性コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "基礎工", "水中不分離性コンクリート工", "水中不分離性コンクリート"],
		["港湾・港湾海岸・空港", "基礎工", "施工管理", ""],
		["港湾・港湾海岸・空港", "基礎工", "その他", ""],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "ケーソン製作用台船"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "底面"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "マット"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "支保"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "足場"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "鉄筋"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "型枠"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "コンクリート"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン・本体ブロック製作工", "その他"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "バラスト"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "止水板"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "上蓋"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "進水"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "仮置"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "回航・曳航"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "ケーソン進水据付工", "据付"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "本体ブロック据付工", "本体ブロック据付"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "中詰工", "砂・石材中詰"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "中詰工", "コンクリート中詰"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "中詰工", "プレパックドコンクリート中詰"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "蓋コンクリート工", "蓋コンクリート"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "蓋ブロック工", "蓋ブロック製作"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "蓋ブロック工", "蓋ブロック据付"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "蓋ブロック工", "間詰コンクリート"],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "施工管理", ""],
		["港湾・港湾海岸・空港", "本体工（ケーソン式・ブロック式）", "その他", ""],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "場所打コンクリート工", "足場"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "場所打コンクリート工", "鉄筋"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "場所打コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "場所打コンクリート工", "伸縮目地工"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "場所打コンクリート工", "コンクリート"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "場所打コンクリート工", "補助ヤード施設"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "水中コンクリート工", "鉄筋"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "水中コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "水中コンクリート工", "漏洩防止"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "水中コンクリート工", "水中コンクリート"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "プレパックドコンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "プレパックドコンクリート工", "漏洩防止"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "プレパックドコンクリート工", "注入管"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "プレパックドコンクリート工", "骨材投入"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "プレパックドコンクリート工", "モルタル注入"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "水中不分離性コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "水中不分離性コンクリート工", "水中不分離性コンクリート"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "施工管理", "品質管理"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "施工管理", "出来形管理"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "施工管理", "その他"],
		["港湾・港湾海岸・空港", "本体工（場所打式）", "その他", ""],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "洗掘防止工", "先掘防止"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "本体捨石工", "本体捨石"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "本体捨石工", "本体捨石均し"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "捨ブロック工", "捨ブロック製作"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "捨ブロック工", "捨ブロック据付"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "場所打コンクリート工", "基礎砕石"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "場所打コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "場所打コンクリート工", "伸縮目地"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "場所打コンクリート工", "コンクリート"],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "施工管理", ""],
		["港湾・港湾海岸・空港", "本体工（捨石・捨ブロック式）", "その他", ""],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "鋼矢板工", "先行掘削"],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "鋼矢板工", "鋼矢板"],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "鋼矢板工", "控鋼矢板"],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "鋼矢板工", "控鋼杭"],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "鋼矢板工", "腹起"],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "鋼矢板工", "タイ材"],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "施工管理", ""],
		["港湾・港湾海岸・空港", "本体工（鋼矢板式）", "その他", ""],
		["港湾・港湾海岸・空港", "本体工（鋼杭式）", "鋼杭工", "先行掘削"],
		["港湾・港湾海岸・空港", "本体工（鋼杭式）", "鋼杭工", "鋼杭"],
		["港湾・港湾海岸・空港", "本体工（鋼杭式）", "施工管理", ""],
		["港湾・港湾海岸・空港", "本体工（鋼杭式）", "その他", ""],
		["港湾・港湾海岸・空港", "本体工（その他形式）", "その他本体工", ""],
		["港湾・港湾海岸・空港", "本体工（その他形式）", "施工管理", ""],
		["港湾・港湾海岸・空港", "本体工（その他形式）", "その他", ""],
		["港湾・港湾海岸・空港", "被覆・根固工", "被覆石工", "被覆石"],
		["港湾・港湾海岸・空港", "被覆・根固工", "被覆石工", "被覆石均し"],
		["港湾・港湾海岸・空港", "被覆・根固工", "袋詰コンクリート工", "袋詰コンクリート"],
		["港湾・港湾海岸・空港", "被覆・根固工", "被覆ブロック工", "被覆ブロック製作"],
		["港湾・港湾海岸・空港", "被覆・根固工", "被覆ブロック工", "被覆ブロック据付"],
		["港湾・港湾海岸・空港", "被覆・根固工", "根固ブロック工", "根固ブロック製作"],
		["港湾・港湾海岸・空港", "被覆・根固工", "根固ブロック工", "根固ブロック据付"],
		["港湾・港湾海岸・空港", "被覆・根固工", "水中コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "被覆・根固工", "水中コンクリート工", "漏洩防止"],
		["港湾・港湾海岸・空港", "被覆・根固工", "水中コンクリート工", "水中コンクリート"],
		["港湾・港湾海岸・空港", "被覆・根固工", "水中不分離性コンクリート工", ""],
		["港湾・港湾海岸・空港", "被覆・根固工", "施工管理", ""],
		["港湾・港湾海岸・空港", "被覆・根固工", "その他", ""],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "支保"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "足場"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "鉄筋"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "型枠"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "伸縮目地"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "コンクリート"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "補助ヤード施設"],
		["港湾・港湾海岸・空港", "上部工", "上部コンクリート工", "その他"],
		["港湾・港湾海岸・空港", "上部工", "上部ブロック工", "上部ブロック製作"],
		["港湾・港湾海岸・空港", "上部工", "上部ブロック工", "上部ブロック据付"],
		["港湾・港湾海岸・空港", "上部工", "施工管理", ""],
		["港湾・港湾海岸・空港", "上部工", "その他", ""],
		["港湾・港湾海岸・空港", "付属工", "係船柱工", "係船柱"],
		["港湾・港湾海岸・空港", "付属工", "防舷材工", "防舷材"],
		["港湾・港湾海岸・空港", "付属工", "車止・縁金物工", "車止"],
		["港湾・港湾海岸・空港", "付属工", "車止・縁金物工", "縁金物"],
		["港湾・港湾海岸・空港", "付属工", "防食工", "電気防食"],
		["港湾・港湾海岸・空港", "付属工", "防食工", "ＦＲＰモルタルライニング"],
		["港湾・港湾海岸・空港", "付属工", "防食工", "ペトロラタムライニング"],
		["港湾・港湾海岸・空港", "付属工", "防食工", "コンクリート被覆"],
		["港湾・港湾海岸・空港", "付属工", "防食工", "防食塗装"],
		["港湾・港湾海岸・空港", "付属工", "防食工", "その他"],
		["港湾・港湾海岸・空港", "付属工", "付属設備工", "係船環"],
		["港湾・港湾海岸・空港", "付属工", "施工管理", ""],
		["港湾・港湾海岸・空港", "付属工", "その他", ""],
		["港湾・港湾海岸・空港", "消波工", "洗掘防止工", "先掘防止"],
		["港湾・港湾海岸・空港", "消波工", "消波ブロック工", "消波ブロック製作"],
		["港湾・港湾海岸・空港", "消波工", "消波ブロック工", "消波ブロック据付"],
		["港湾・港湾海岸・空港", "消波工", "施工管理", ""],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏込工", "目地板"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏込工", "裏込材"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏込工", "裏込均し"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏込工", "吸い出し防止材"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏埋工", "裏埋材"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏埋土工", "土砂掘削"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "裏埋土工", "土砂盛土"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "施工管理", "品質管理"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "施工管理", "出来形管理"],
		["港湾・港湾海岸・空港", "裏込・裏埋工", "施工管理", "その他"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "サンドドレーン"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "敷砂"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "敷砂均し"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "載荷土砂"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "ペーパードレーン"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "ﾍﾟｰﾊﾟｰﾄﾞﾚｰﾝ（液状化対策）"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "クラベルマット"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "パックドレーン"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "圧密・排水工", "グラベルドレーン"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "固化工", "深層混合処理杭"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "固化工", "盛上土砂撤去"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "固化工", "敷砂"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "固化工", "敷砂均し"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "固化工", "事前混合処理"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "固化工", "表層固化処理工"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "締固工", "サンドコンパクションパイル"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "締固工", "ロッドコンパクション"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "施工管理", "品質管理"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "施工管理", "出来形管理"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "施工管理", "その他"],
		["港湾・港湾海岸・空港", "陸上地盤改良工", "その他", ""],
		["港湾・港湾海岸・空港", "土工", "掘削工", "土砂掘削"],
		["港湾・港湾海岸・空港", "土工", "盛土工", "土砂盛土"],
		["港湾・港湾海岸・空港", "土工", "施工管理", ""],
		["港湾・港湾海岸・空港", "土工", "その他", ""],
		["港湾・港湾海岸・空港", "舗装工", "路床工", "不陸整正"],
		["港湾・港湾海岸・空港", "舗装工", "路盤工", "下層路盤"],
		["港湾・港湾海岸・空港", "舗装工", "路盤工", "上層路盤"],
		["港湾・港湾海岸・空港", "舗装工", "コンクリート舗装工", "コンクリート舗装"],
		["港湾・港湾海岸・空港", "舗装工", "コンクリート舗装工", "目地"],
		["港湾・港湾海岸・空港", "舗装工", "コンクリート舗装工", "小口止め"],
		["港湾・港湾海岸・空港", "舗装工", "アスファルト舗装工", "基層"],
		["港湾・港湾海岸・空港", "舗装工", "アスファルト舗装工", "表層"],
		["港湾・港湾海岸・空港", "舗装工", "施工管理", ""],
		["港湾・港湾海岸・空港", "舗装工", "その他", ""],
		["港湾・港湾海岸・空港", "沈埋トンネル工", "沈埋函製作工", ""],
		["港湾・港湾海岸・空港", "沈埋トンネル工", "沈埋函運搬・沈設工", ""],
		["港湾・港湾海岸・空港", "沈埋トンネル工", "継手工", ""],
		["港湾・港湾海岸・空港", "沈埋トンネル工", "立坑工", ""],
		["港湾・港湾海岸・空港", "沈埋トンネル工", "施工管理", ""],
		["港湾・港湾海岸・空港", "沈埋トンネル工", "その他", ""],
		["港湾・港湾海岸・空港", "橋梁工", "鋼橋製作・架設工", ""],
		["港湾・港湾海岸・空港", "橋梁工", "床版工", ""],
		["港湾・港湾海岸・空港", "橋梁工", "継手工", ""],
		["港湾・港湾海岸・空港", "橋梁工", "ＰＣ橋製作・架設工", ""],
		["港湾・港湾海岸・空港", "橋梁工", "施工管理", ""],
		["港湾・港湾海岸・空港", "橋梁工", "その他", ""],
		["港湾・港湾海岸・空港", "維持補修工", "維持塗装工", "係船柱塗装"],
		["港湾・港湾海岸・空港", "維持補修工", "維持塗装工", "車止塗装"],
		["港湾・港湾海岸・空港", "維持補修工", "維持塗装工", "縁金物塗装"],
		["港湾・港湾海岸・空港", "維持補修工", "防食工", "電気防食"],
		["港湾・港湾海岸・空港", "維持補修工", "防食工", "ＦＲＰモルタルライニング"],
		["港湾・港湾海岸・空港", "維持補修工", "防食工", "ペトロラタムライニング"],
		["港湾・港湾海岸・空港", "維持補修工", "防食工", "コンクリート被覆"],
		["港湾・港湾海岸・空港", "維持補修工", "防食工", "防食塗装"],
		["港湾・港湾海岸・空港", "維持補修工", "防食工", "その他防食工法"],
		["港湾・港湾海岸・空港", "維持補修工", "鋼材補修工", "鋼板溶接"],
		["港湾・港湾海岸・空港", "維持補修工", "鋼材補修工", "コンクリート被覆"],
		["港湾・港湾海岸・空港", "維持補修工", "コンクリート補修工", "ひびわれ補修"],
		["港湾・港湾海岸・空港", "維持補修工", "コンクリート補修工", "断面修復"],
		["港湾・港湾海岸・空港", "維持補修工", "コンクリート補修工", "ライニング"],
		["港湾・港湾海岸・空港", "維持補修工", "施工管理", ""],
		["港湾・港湾海岸・空港", "維持補修工", "その他", ""],
		["港湾・港湾海岸・空港", "雑工", "現場鋼材溶接工", "現場鋼材溶接"],
		["港湾・港湾海岸・空港", "雑工", "現場鋼材溶接工", "被覆溶接（水中）"],
		["港湾・港湾海岸・空港", "雑工", "現場鋼材溶接工", "スタッド溶接（水中）"],
		["港湾・港湾海岸・空港", "雑工", "現場鋼材切断工", "現場鋼材切断"],
		["港湾・港湾海岸・空港", "雑工", "その他雑工", "清掃"],
		["港湾・港湾海岸・空港", "雑工", "その他雑工", "削孔"],
		["港湾・港湾海岸・空港", "雑工", "その他雑工", "その他"],
		["港湾・港湾海岸・空港", "雑工", "設備工", "機械設備"],
		["港湾・港湾海岸・空港", "雑工", "設備工", "用水設備"],
		["港湾・港湾海岸・空港", "雑工", "施工管理", ""],
		["港湾・港湾海岸・空港", "雑工", "その他", ""],
		["港湾・港湾海岸・空港", "構造物撤去工", "取り壊し工", "コンクリート取り壊し"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "水中コンクリート撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "鋼矢板等切断撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "服起・タイ材撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "舗装版撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "石材撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "ケーソン撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "ブロック撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "鋼矢板等引抜き撤去"],
		["港湾・港湾海岸・空港", "構造物撤去工", "撤去工", "その他"],
		["港湾・港湾海岸・空港", "仮設工", "仮設鋼矢板工", "先行掘削"],
		["港湾・港湾海岸・空港", "仮設工", "仮設鋼矢板工", "仮設鋼矢板・Ｈ形鋼杭"],
		["港湾・港湾海岸・空港", "仮設工", "仮設鋼管杭・鋼管矢板工", "先行掘削"],
		["港湾・港湾海岸・空港", "仮設工", "仮設鋼管杭・鋼管矢板工", "仮設鋼管杭・鋼管矢板"],
		["港湾・港湾海岸・空港", "仮設工", "仮設道路工", "仮設道路"],
		["港湾・港湾海岸・空港", "仮設工", "仮囲い工", ""],
		["港湾・港湾海岸・空港", "仮設工", "仮橋工", ""],
		["港湾・港湾海岸・空港", "仮設工", "仮桟橋工", ""],
		["港湾・港湾海岸・空港", "仮設工", "その他", ""],
		["港湾・港湾海岸・空港", "環境対策工", "水質汚濁防止工", ""],
		["港湾・港湾海岸・空港", "環境対策工", "濁水処理工", ""],
		["港湾・港湾海岸・空港", "環境対策工", "振動・騒音対策工", ""],
		["港湾・港湾海岸・空港", "環境対策工", "大気汚染対策工", ""],
		["港湾・港湾海岸・空港", "環境対策工", "地盤沈下・地下対策工", ""],
		["港湾・港湾海岸・空港", "環境対策工", "構造物損傷対策工", ""],
		["港湾・港湾海岸・空港", "環境対策工", "その他", ""],
		["港湾・港湾海岸・空港", "測量調査", "測量", ""],
		["港湾・港湾海岸・空港", "測量調査", "土質調査", ""],
		["港湾・港湾海岸・空港", "測量調査", "構造物調査", ""],
		["港湾・港湾海岸・空港", "測量調査", "環境調査", ""],
		["港湾・港湾海岸・空港", "測量調査", "磁気探査", ""],
		["港湾・港湾海岸・空港", "測量調査", "その他", ""],
		["港湾・港湾海岸・空港", "安全対策工", "標識工", ""],
		["港湾・港湾海岸・空港", "安全対策工", "安全対策工", ""],
		["港湾・港湾海岸・空港", "安全対策工", "その他", ""],
		["港湾・港湾海岸・空港", "その他", "", ""],
		["空港土木", "掘削工", "", ""],
		["空港土木", "埋戻工", "", ""],
		["空港土木", "切土工", "", ""],
		["空港土木", "盛土工", "", ""],
		["空港土木", "法面工", "石積(張)工", ""],
		["空港土木", "法面工", "コンクリートブロック積(張)工", ""],
		["空港土木", "施工管理", "", ""],
		["空港土木", "その他", "", ""],
		["空港舗装工", "路床工", "", ""],
		["空港舗装工", "路盤工", "", ""],
		["空港舗装工", "コンクリート舗装工", "", ""],
		["空港舗装工", "アスファルト舗装工", "", ""],
		["空港舗装工", "グルービング工", "", ""],
		["空港舗装工", "施工管理", "", ""],
		["空港舗装工", "その他", "標識工", ""],
		["柵工", "鋼製フェンス工", "", ""],
		["柵工", "FRPフェンス工", "", ""],
		["柵工", "施工管理", "", ""],
		["柵工", "その他", "", ""],
		["撤去工", "構造物撤去工", "", ""],
		["撤去工", "舗装版撤去工", "", ""],
		["撤去工", "舗装切削工", "", ""],
		["撤去工", "施工管理", "", ""],
		["撤去工", "その他", "", ""]
	];

	$.fn.category_chooser = function(args) {
		var self = this;
		const defaults = {};
		self.settings = {};
		self.rendered = false;
		function data_analysis(json) {
			let dict = {};
			for (let i in json) {
				let item = json[i];
				if (item[0] == '') continue;
				if (!(item[0] in dict)) {
					dict[item[0]] = {};
				}
				if (item[1] == '') continue;
				if (!(item[1] in dict[item[0]])) {
					dict[item[0]][item[1]] = {};
				}
				if (item[2] == '') continue;
				if (!(item[2] in dict[item[0]][item[1]])) {
					dict[item[0]][item[1]][item[2]] = {};
				}
				if (item[3] == '') continue;
				if (!(item[3] in dict[item[0]][item[1]][item[2]])) {
					dict[item[0]][item[1]][item[2]][item[3]] = {};
				}
			}
			return dict;
		}
		self.dict = data_analysis(data_array);

		self.level1 = "";
		self.level2 = "";
		self.level3 = "";
		self.level4 = "";

		function getL0() {
			return self.dict;
		}
		function getL1() {
			if (self.dict &&
				self.dict[self.level1])
			{
				return self.dict[self.level1];
			}
			return null;
		}
		function getL2() {
			if (self.dict &&
				self.dict[self.level1] &&
				self.dict[self.level1][self.level2])
			{
				return self.dict[self.level1][self.level2];
			}
			return null;
		}
		function getL3() {
			if (self.dict &&
				self.dict[self.level1] &&
				self.dict[self.level1][self.level2] &&
				self.dict[self.level1][self.level2][self.level3])
			{
				return self.dict[self.level1][self.level2][self.level3];
			}
			return null;
		}
		function getL4() {
			if (self.dict &&
				self.dict[self.level1] &&
				self.dict[self.level1][self.level2] &&
				self.dict[self.level1][self.level2][self.level3] &&
				self.dict[self.level1][self.level2][self.level3][self.level4])
			{
				return self.dict[self.level1][self.level2][self.level3][self.level4];
			}
			return null;
		}
		function clear_select(target, disabled) {
			target.empty();
			target.append('<option value="" selected>&nbsp;</option>');
			target.prop('disabled', disabled ? true : false);
		}
		function setLevel0(level1, level2, level3, level4) {
			clear_select(level1);
			clear_select(level2, true);
			clear_select(level3, true);
			clear_select(level4, true);
			self.level1 = "";
			self.level2 = "";
			self.level3 = "";
			self.level4 = "";
			level1.prop('disabled', true);
			let L0 = getL0();
			if (L0) {
				for (let i in L0) {
					level1.append('<option value="' + i + '">' + i + '</option>');
					level1.prop('disabled', false);
				}
			}
		}
		function setLevel1(level1, level2, level3, level4) {
			let newValue = level1.val();
			self.level1 = newValue;
			clear_select(level2);
			clear_select(level3, true);
			clear_select(level4, true);
			self.level2 = "";
			self.level3 = "";
			self.level4 = "";
			level2.prop('disabled', true);
			let L1 = getL1();
			if (L1) {
				for (let i in L1) {
					level2.append('<option value="' + i + '">' + i + '</option>');
					level2.prop('disabled', false);
				}
			}
		}
		function setLevel2(level1, level2, level3, level4) {
			let newValue = level2.val();
			self.level1 = level1.val();
			self.level2 = newValue;
			clear_select(level3);
			clear_select(level4, true);
			self.level3 = "";
			self.level4 = "";
			level3.prop('disabled', true);
			let L2 = getL2();
			if (L2) {
				for (let i in L2) {
					level3.append('<option value="' + i + '">' + i + '</option>');
					level3.prop('disabled', false);
				}
			}
		}
		function setLevel3(level1, level2, level3, level4) {
			let newValue = level3.val();
			self.level1 = level1.val();
			self.level2 = level2.val();
			self.level3 = newValue;
			clear_select(level4);
			self.level4 = "";
			level4.prop('disabled', true);
			let L3 = getL3();
			if (L3) {
				for (let i in L3) {
					level4.append('<option value="' + i + '">' + i + '</option>');
					level4.prop('disabled', false);
				}
			}
		}
		function setLevel4(level1, level2, level3, level4) {
			let newValue = level4.val();
			self.level1 = level1.val();
			self.level2 = level2.val();
			self.level3 = level3.val();
			self.level4 = newValue;
		}

		var methods = {
			init: function(options) {
				self.settings = $.extend(true, {}, defaults, options);
				return self.each(function(index, element) {
					let id = $(element).attr("id");
					var html = '';
					html += '<ul class="category">';
					html += '    <li class="category_level l1">';
					html += '        <span class="level_label">レベル1</span><br />';
					html += '        <select id="' + id + '-level1" class="category_select level1">';
					html += '            <option value="" selected></option>';
					html += '        </select>';
					html += '    </li>';
					html += '    <li class="category_level l2">';
					html += '        <span class="level_label">レベル2</span><br />';
					html += '        <select id="' + id + '-level2" class="category_select level2">';
					html += '            <option value="" selected></option>';
					html += '        </select>';
					html += '    </li>';
					html += '    <li class="category_level l3">';
					html += '        <span class="level_label">レベル3</span><br />';
					html += '        <select id="' + id + '-level3" class="category_select level3">';
					html += '            <option value="" selected></option>';
					html += '        </select>';
					html += '    </li>';
					html += '    <li class="category_level l4">';
					html += '        <span class="level_label">レベル4</span><br />';
					html += '        <select id="' + id + '-level4" class="category_select level4">';
					html += '            <option value="" selected></option>';
					html += '        </select>';
					html += '    </li>';
					html += '</ul>';
					$(element).html(html);

					let level1_id = "#" + id + "-level1";
					let level2_id = "#" + id + "-level2";
					let level3_id = "#" + id + "-level3";
					let level4_id = "#" + id + "-level4";

					setLevel0($(level1_id), $(level2_id), $(level3_id), $(level4_id));

					$(level1_id).on('change', function(){
						setLevel1($(level1_id), $(level2_id), $(level3_id), $(level4_id));
					});

					$(level2_id).on('change', function(){
						setLevel2($(level1_id), $(level2_id), $(level3_id), $(level4_id));
					});

					$(level3_id).on('change', function(){
						setLevel3($(level1_id), $(level2_id), $(level3_id), $(level4_id));
					});

					$(level4_id).on('change', function(){
						setLevel4($(level1_id), $(level2_id), $(level3_id), $(level4_id));
					});
				});
			},
			level1: function(newValue) {
				if (newValue == undefined) {
					return self.level1;
				}
				return self.each(function(index, element) {
					let id = $(element).attr("id");
					let level1_id = "#" + id + "-level1";
					let level2_id = "#" + id + "-level2";
					let level3_id = "#" + id + "-level3";
					let level4_id = "#" + id + "-level4";
					$(level1_id).val(newValue);
					setLevel1($(level1_id), $(level2_id), $(level3_id), $(level4_id));
				});
			},
			level2: function(newValue) {
				if (newValue == undefined) {
					return self.level2;
				}
				return self.each(function(index, element) {
					let id = $(element).attr("id");
					let level1_id = "#" + id + "-level1";
					let level2_id = "#" + id + "-level2";
					let level3_id = "#" + id + "-level3";
					let level4_id = "#" + id + "-level4";
					$(level2_id).val(newValue);
					setLevel2($(level1_id), $(level2_id), $(level3_id), $(level4_id));
				});
			},
			level3: function(newValue) {
				if (newValue == undefined) {
					return self.level3;
				}
				return self.each(function(index, element) {
					let id = $(element).attr("id");
					let level1_id = "#" + id + "-level1";
					let level2_id = "#" + id + "-level2";
					let level3_id = "#" + id + "-level3";
					let level4_id = "#" + id + "-level4";
					$(level3_id).val(newValue);
					setLevel3($(level1_id), $(level2_id), $(level3_id), $(level4_id));
				});
			},
			level4: function(newValue) {
				if (newValue == undefined) {
					return self.level4;
				}
				return self.each(function(index, element) {
					let id = $(element).attr("id");
					let level1_id = "#" + id + "-level1";
					let level2_id = "#" + id + "-level2";
					let level3_id = "#" + id + "-level3";
					let level4_id = "#" + id + "-level4";
					$(level4_id).val(newValue);
					setLevel4($(level1_id), $(level2_id), $(level3_id), $(level4_id));
				});
			},
			value: function(newValue) {
				if (newValue == undefined) {
					return self.level1 + "\t" + self.level2 + "\t" + self.level3 + "\t" + self.level4;
				}
				return self.each(function(index, element) {
					let id = $(element).attr("id");
					let level1_id = "#" + id + "-level1";
					let level2_id = "#" + id + "-level2";
					let level3_id = "#" + id + "-level3";
					let level4_id = "#" + id + "-level4";
					let values = newValue.split("\t");
					if (values.length == 4) {
						$(level1_id).val(values[0]);
						setLevel1($(level1_id), $(level2_id), $(level3_id), $(level4_id));
						$(level2_id).val(values[1]);
						setLevel2($(level1_id), $(level2_id), $(level3_id), $(level4_id));
						$(level3_id).val(values[2]);
						setLevel3($(level1_id), $(level2_id), $(level3_id), $(level4_id));
						$(level4_id).val(values[3]);
						setLevel4($(level1_id), $(level2_id), $(level3_id), $(level4_id));
					}
				});
			},
		};
		if (methods[args]) {
			return methods[args].apply(this, Array.prototype.slice.call(arguments, 1));
		} else if (typeof args === 'object' || !args) {
			return methods.init.apply(this, arguments);
		} else {
			$.error("Method '" + args + "' not found in category_chooser");
		}
	};
})(jQuery);
